
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>版本一 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.2">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    
    <link rel="prev" href="FrontPanel.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    说明书
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="FrontPanel.html">
            
                <a href="FrontPanel.html">
            
                    
                    前面版
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.3" data-path="Version1.html">
            
                <a href="Version1.html">
            
                    
                    版本一
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >版本一</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <!-- Version1.md --- 
;; 
;; Description: 
;; Author: Hongyi Wu(吴鸿毅)
;; Email: wuhongyi@qq.com 
;; Created: 四 7月 21 14:18:36 2016 (+0800)
;; Last-Updated: 四 7月 21 18:51:29 2016 (+0800)
;;           By: Hongyi Wu(吴鸿毅)
;;     Update #: 17
;; URL: http://wuhongyi.cn -->
<h1 id="xia-&#x83B7;&#x53D6;&#x5F53;&#x524D;&#x8FDB;&#x5EA6;">XIA &#x83B7;&#x53D6;&#x5F53;&#x524D;&#x8FDB;&#x5EA6;</h1>
<hr>
<h2 id="xia-&#x4E0E;-caen-&#x7684;&#x533A;&#x522B;">XIA &#x4E0E; CAEN &#x7684;&#x533A;&#x522B;</h2>
<p>CAEN &#x63D2;&#x4EF6;&#x5728;&#x91C7;&#x96C6;&#x6CE2;&#x5F62;&#x65F6;&#xFF0C;&#x4E00;&#x4E2A;&#x63D2;&#x4EF6;&#x6240;&#x6709;&#x901A;&#x9053;&#x6BCF;&#x4E2A;&#x4E8B;&#x4EF6;&#x7684;&#x91C7;&#x6837;&#x957F;&#x5EA6;&#x53EA;&#x80FD;&#x8BBE;&#x7F6E;&#x6210;&#x76F8;&#x540C;&#x7684;&#x3002;&#x800C; XIA &#x63D2;&#x4EF6;&#x53EF;&#x4EE5;&#x6BCF;&#x4E2A;&#x901A;&#x9053;&#x5355;&#x72EC;&#x8BBE;&#x7F6E;&#xFF0C;&#x4F8B;&#x5982;&#xFF1A;ch-0 &#x8BBE;&#x7F6E;&#x91C7;3000&#x4E2A;&#x70B9;&#xFF0C;ch-1 &#x8BBE;&#x7F6E;&#x91C7;2000&#x4E2A;&#x70B9;&#xFF0C;ch-2 &#x8BBE;&#x7F6E;&#x91C7;5000&#x4E2A;&#x70B9;&#xFF0C;ch-3 &#x8BBE;&#x7F6E;&#x6210;&#x4E0D;&#x91C7;&#x96C6;&#x6CE2;&#x5F62;&#x2026;&#x2026;&#x3002;</p>
<p>&#x5728;&#x8BFB;&#x53D6;&#x6570;&#x636E;&#x65F6;&#x5019;&#xFF0C;CAEN &#x63D2;&#x4EF6;&#x6BCF;&#x6B21;&#x62FF;&#x5230;&#x7684;&#x6570;&#x636E;&#x90FD;&#x662F;&#x5B8C;&#x6574;&#x4E8B;&#x4EF6;&#x7684;&#x6570;&#x636E;&#x3002;&#x800C; XIA &#x63D2;&#x4EF6; FIFO &#x7684;&#x8BFB;&#x6307;&#x9488;&#x3001;&#x5199;&#x6307;&#x9488;&#x662F;&#x72EC;&#x7ACB;&#x7684;&#x3001;&#x540C;&#x65F6;&#x8FDB;&#x884C;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x6BCF;&#x6B21;&#x6211;&#x4EEC;&#x8981;&#x53D6;&#x6570;&#x636E;&#x65F6;&#x5019;&#x90FD;&#x9700;&#x8981;&#x5148;&#x67E5;&#x8BE2;&#x4E0B;&#x5F53;&#x524D; FIFO &#x6709;&#x591A;&#x5C11;&#x6570;&#x636E;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x6307;&#x5B9A;&#x8BE5;&#x6B21;&#x8BFB;&#x53D6;&#x591A;&#x5C11;&#x6570;&#x636E;&#x3002;&#x56E0;&#x4E3A;FIFO&#x8BFB;&#x3001;&#x5199;&#x662F;&#x72EC;&#x7ACB;&#x7684;&#xFF0C;&#x56E0;&#x800C;&#x67E5;&#x8BE2;&#x5230;&#x7684;&#x6570;&#x636E;&#x91CF;&#x662F;&#x8BE5;&#x65F6;&#x523B;&#x62E5;&#x6709;&#x7684;&#x6570;&#x636E;&#x91CF;&#xFF0C;&#x8FD9;&#x4E2A;&#x6570;&#x636E;&#x91CF;&#x57FA;&#x672C;&#x90FD;&#x4E0D;&#x662F;&#x5B8C;&#x6574;&#x4E8B;&#x4EF6;&#x7684;&#x6570;&#x636E;&#x91CF;&#xFF08;&#x8FD8;&#x6709;&#x90E8;&#x5206;&#x662F;&#x5F53;&#x524D;&#x4E8B;&#x4EF6;&#x6B63;&#x5728;&#x5199;&#x5165;&#x7684;&#xFF09;&#x3002;&#x6BCF;&#x4E2A;&#x4E8B;&#x4EF6;&#x9664;&#x4E86;&#x6709; 4 words &#x7684; header &#x53CA;&#x540E;&#x9762;&#x7D27;&#x8DDF;&#x7740;&#x7684;&#x6570;&#x636E;&#x5916;&#x5E76;&#x6CA1;&#x6709;&#x4E8B;&#x4EF6;&#x6807;&#x8BB0;&#x7B26;&#xFF0C;&#x5F53;&#x7136;&#x8FD9;&#x6837;&#x8BBE;&#x8BA1;&#x6700;&#x5927;&#x7684;&#x597D;&#x5904;&#x5C31;&#x662F;&#x901F;&#x5EA6;&#x5FEB;&#x3002;</p>
<h2 id="&#x7075;&#x6D3B;&#x6027;&#x5E26;&#x6765;&#x7684;&#x95EE;&#x9898;">&#x7075;&#x6D3B;&#x6027;&#x5E26;&#x6765;&#x7684;&#x95EE;&#x9898;</h2>
<p>&#x57FA;&#x4E8E;&#x4EE5;&#x4E0A;&#x4E8B;&#x5B9E;&#xFF0C;&#x4E24;&#x4E2A;&#x516C;&#x53F8;&#x7684;&#x4EA7;&#x54C1;&#x5BF9;&#x7528;&#x6237;&#x5199;&#x65F6;&#x65F6;&#x76D1;&#x89C6;&#x83B7;&#x53D6;&#x7387;&#x3001;&#x5728;&#x7EBF;&#x76D1;&#x89C6;&#x7A0B;&#x5E8F;&#x7B49;&#x7684;&#x5B9E;&#x73B0;&#x65B9;&#x5F0F;&#x5B58;&#x5728;&#x8F83;&#x5927;&#x5DEE;&#x5F02;&#x3002;</p>
<p>CAEN&#xFF1A;
&#x7531;&#x4E8E; CAEN &#x4E00;&#x4E2A;&#x63D2;&#x4EF6;&#x4E0A;&#x6BCF;&#x4E2A;&#x901A;&#x9053;&#x7684;&#x91C7;&#x6837;&#x6570;&#x76F8;&#x540C;&#xFF0C;&#x56E0;&#x800C;&#x4ED6;&#x4EEC;&#x6BCF;&#x4E2A;&#x4E8B;&#x4EF6;&#x7684;&#x957F;&#x5EA6;&#x662F;&#x4E00;&#x81F4;&#x7684;&#x3002;&#x5728;&#x62FF;&#x5230;&#x6570;&#x636E;&#x65F6;&#x5373;&#x53EF;&#x5B58;&#x6587;&#x4EF6;&#x6216;&#x8005; decode &#x51FA;&#x6BCF;&#x4E2A;&#x4E8B;&#x4EF6;&#x7684;&#x4FE1;&#x606F;&#x7528;&#x6765;&#x7EDF;&#x8BA1;&#x65F6;&#x65F6;&#x83B7;&#x53D6;&#x901F;&#x7387;&#xFF0C;&#x4E5F;&#x53EF;&#x5C06;&#x6570;&#x636E;&#x53D1;&#x9001;&#x5230;&#x5728;&#x7EBF;&#x7A0B;&#x5E8F;&#x3002;</p>
<p>XIA&#xFF1A;
&#x7531;&#x4E8E;&#x5176;&#x4E0A;&#x6BCF;&#x4E2A;&#x901A;&#x9053;&#x6570;&#x636E;&#x957F;&#x5EA6;&#x53EF;&#x5355;&#x72EC;&#x8BBE;&#x7F6E;&#xFF0C;&#x8FD9;&#x662F; XIA &#x63D2;&#x4EF6;&#x7684;&#x7075;&#x6D3B;&#x6027;&#x3002;&#x53C8; FIFO &#x67E5;&#x8BE2;&#x5230;&#x7684;&#x6570;&#x636E;&#x91CF;&#x662F;&#x5F53;&#x524D;&#x65F6;&#x523B;&#x7684;&#x6570;&#x636E;&#x91CF;&#xFF0C;&#x8FD9;&#x6837;&#x6BCF;&#x6B21;&#x53D6;&#x5230;&#x7684;&#x6570;&#x636E;&#x90FD;&#x4E0D;&#x662F;&#x5B8C;&#x6574;&#x4E8B;&#x4EF6;&#x7684;&#x6570;&#x636E;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;&#x591A;&#x4E2A;&#x63D2;&#x4EF6;&#x7684;&#x7CFB;&#x7EDF;&#xFF0C;&#x83B7;&#x53D6;&#x65F6;&#x5019;&#x4E00;&#x76F4;&#x5FAA;&#x73AF;&#x8BFB;&#x53D6;&#x6BCF;&#x4E00;&#x4E2A;&#x63D2;&#x4EF6;&#x4E0A;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x5982;&#x679C;&#x5C06;&#x6240;&#x6709;&#x63D2;&#x4EF6;&#x7684;&#x6570;&#x636E;&#x5B58;&#x5728;&#x540C;&#x4E00;&#x4E2A;&#x6587;&#x4EF6;&#x5185;&#xFF0C;&#x5C06;&#x9020;&#x6210;&#x6570;&#x636E;&#x7684;&#x9519;&#x4E71;&#x3002;&#x5982;&#x679C;&#x6BCF;&#x4E2A;&#x63D2;&#x4EF6;&#x7684;&#x6570;&#x636E;&#x5355;&#x72EC;&#x5B58;&#x5728;&#x4E00;&#x4E2A;&#x6587;&#x4EF6;&#x5185;&#xFF0C;&#x90A3;&#x4E48;&#x4E0B;&#x4E00;&#x6B21;&#x8BFB;&#x53D6;&#x7684;&#x8BE5;&#x63D2;&#x4EF6;&#x7684;&#x6570;&#x636E;&#x4E2D;&#x5F00;&#x5934;&#x7684;&#x4E0D;&#x5B8C;&#x6574;&#x4E8B;&#x4EF6;&#x7684;&#x6570;&#x636E;&#x521A;&#x597D;&#x63A5;&#x4E0A;&#x4E00;&#x6B21;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x4E0D;&#x5B8C;&#x6574;&#x4E8B;&#x4EF6;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x53EF;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x7531;&#x4E8E;&#x6BCF;&#x6B21;&#x62FF;&#x5230;&#x7684;&#x4E0D;&#x662F;&#x5B8C;&#x6574;&#x6570;&#x636E;&#xFF0C;&#x56E0;&#x6B64;&#x4E5F;&#x4E0D;&#x597D; decode &#x5F53;&#x524D;&#x6570;&#x636E;&#x6765;&#x83B7;&#x5F97;&#x6BCF;&#x4E2A;&#x4E8B;&#x4EF6;&#x7684;&#x4FE1;&#x606F;&#xFF08;&#x4ECE;&#x5F00;&#x59CB;&#x5C31;decode&#x8BB0;&#x5F55;&#x6BCF;&#x6B21;&#x6570;&#x636E;&#x7684;&#x4E0D;&#x5B8C;&#x6574;&#x4E8B;&#x4EF6;&#x7684;&#x60C5;&#x51B5;&#x4E5F;&#x53EF;&#x89E3;&#x51B3;&#x8BE5;&#x95EE;&#x9898;&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x6837;decode&#x9700;&#x8981;&#x989D;&#x5916;&#x7684;&#x65F6;&#x95F4;&#xFF09;&#x3002;&#x4F46;&#x662F; XIA &#x5185;&#x90E8; DSP &#x4E0A;&#x7EDF;&#x8BA1;&#x7740;&#x4FE1;&#x53F7;&#x8F93;&#x5165;&#x91CF;&#x3001;&#x83B7;&#x53D6;&#x63A5;&#x6536;&#x91CF;&#x3001;&#x6D3B;&#x65F6;&#x7B49;&#x4FE1;&#x606F;&#x3002;&#x53EF;&#x9891;&#x7E41;&#x8C03;&#x7528;&#x51FD;&#x6570;&#x8BFB;&#x53D6; DSP &#x4E0A;&#x7684;&#x7EDF;&#x8BA1;&#x4FE1;&#x606F;&#x6765;&#x76D1;&#x89C6;&#x65F6;&#x65F6;&#x83B7;&#x53D6;&#x901F;&#x7387;&#x3002;&#x4F46;&#x662F;&#x9891;&#x7E41;&#x8C03;&#x7528;&#x8BE5;&#x51FD;&#x6570;&#x4F1A;&#x5BF9;&#x83B7;&#x53D6;&#x7684; I/O &#x6709;&#x4E00;&#x70B9;&#x5F71;&#x54CD;&#x3002;</p>
<p>&#x7531;&#x4E8E;&#x6BCF;&#x6B21;&#x62FF;&#x5230;&#x7684;&#x4E0D;&#x662F;&#x5B8C;&#x6574;&#x6570;&#x636E;&#xFF0C;&#x56E0;&#x6B64;&#x5171;&#x4EAB;&#x5185;&#x5B58;&#x7684;&#x5728;&#x7EBF;&#x76D1;&#x89C6;&#x4E5F;&#x4E0D;&#x5BB9;&#x6613;&#x5B9E;&#x73B0;&#xFF0C;&#x5982;&#x82E5;&#x8981;&#x5B9E;&#x73B0;&#xFF0C;&#x4E5F;&#x4E0D;&#x662F;&#x6CA1;&#x529E;&#x6CD5;&#xFF08;&#x4ECE;&#x5F00;&#x59CB;&#x5C31;decode&#x8BB0;&#x5F55;&#x6BCF;&#x6B21;&#x6570;&#x636E;&#x7684;&#x4E0D;&#x5B8C;&#x6574;&#x4E8B;&#x4EF6;&#x7684;&#x60C5;&#x51B5;&#x4E5F;&#x53EF;&#x89E3;&#x51B3;&#x8BE5;&#x95EE;&#x9898;&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x6837;decode&#x9700;&#x8981;&#x989D;&#x5916;&#x7684;&#x65F6;&#x95F4;&#xFF09;&#x3002;</p>
<p>&#x4E0B;&#x9762;&#x7ED9;&#x51FA;&#x4E00;&#x4E9B;&#x56F0;&#x96BE;&#x7684;&#x89E3;&#x51B3;&#x601D;&#x8DEF;&#xFF1A;
&#x727A;&#x7272; XIA &#x63D2;&#x4EF6;&#x7684;&#x7075;&#x6D3B;&#x6027;&#xFF0C;&#x5BF9;&#x4E00;&#x4E2A;&#x63D2;&#x4EF6;&#x8BBE;&#x7F6E;&#x6210;&#x6BCF;&#x4E2A;&#x901A;&#x9053;&#x91C7;&#x96C6;&#x6CE2;&#x5F62;&#x957F;&#x5EA6;&#x76F8;&#x540C;&#xFF08;&#x8FD9;&#x6837;&#x5C31;&#x4E0E; CAEN &#x4E00;&#x6837;&#x4E86;&#xFF09;&#xFF0C;&#x56E0;&#x4E3A;&#x6BCF;&#x4E2A;&#x901A;&#x9053;&#x7684;&#x6BCF;&#x4E2A;&#x4E8B;&#x4EF6;&#x6570;&#x636E;&#x7684;&#x957F;&#x5EA6;&#x76F8;&#x7B49;&#xFF0C;&#x8BFB;&#x53D6;&#x6570;&#x636E;&#x65F6;&#x5019;&#x67E5;&#x8BE2;&#x5230;&#x5F53;&#x524D;&#x7684;&#x6570;&#x636E;&#x91CF;&#x4E4B;&#x540E;&#xFF0C;&#x7136;&#x540E;&#x53EA;&#x8BFB;&#x53D6;&#x4E8B;&#x4EF6;&#x957F;&#x5EA6;&#x6574;&#x6570;&#x500D;&#x7684;&#x6700;&#x5927;&#x6570;&#x636E;&#xFF0C;&#x8FD9;&#x6837;&#x6BCF;&#x6B21;&#x62FF;&#x5230;&#x7684;&#x90FD;&#x662F;&#x5B8C;&#x6574;&#x7684;&#x4E8B;&#x4EF6;&#x6570;&#x636E;&#x4E86;&#xFF0C;&#x53EF;&#x53C2;&#x7167; CAEN &#x7684;&#x5B9E;&#x73B0;&#x65B9;&#x5F0F;&#x3002;</p>
<p>&#x5BF9;&#x91C7;&#x6CE2;&#x5F62;&#x65F6;&#x5019;&#xFF0C;&#x53EF;&#x91C7;&#x7528;&#x201C;&#x4F2A;&#x201D;&#x5728;&#x7EBF;&#x76D1;&#x89C6;&#x83B7;&#x53D6;&#x60C5;&#x51B5;&#xFF0C;&#x5373;&#x83B7;&#x53D6;&#x6587;&#x4EF6;&#x6BCF;&#x9694;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x4FDD;&#x5B58;&#x4E00;&#x6B21;&#xFF0C;&#x7528;&#x4E0A;&#x4E00;&#x8F6E;&#x7684;&#x6570;&#x636E;&#x4F5C;&#x4E3A;&#x201C;&#x5728;&#x7EBF;&#x201D;&#x6570;&#x636E;&#x3002;</p>
<hr>
<h1 id="&#x5F53;&#x524D;&#x5B8C;&#x6210;&#x60C5;&#x51B5;">&#x5F53;&#x524D;&#x5B8C;&#x6210;&#x60C5;&#x51B5;</h1>
<p>&#x5F53;&#x524D;&#x5B8C;&#x6210;&#x60C5;&#x51B5;&#xFF1A;&#x5B9E;&#x9A8C;&#x524D;&#x671F;&#x83B7;&#x53D6;&#x53C2;&#x6570;&#x7684;&#x8C03;&#x8282;&#xFF08;&#x56FE;&#x5F62;&#x754C;&#x9762;&#xFF09;&#x3001;&#x5B9E;&#x9A8C;&#x4E2D;&#x6570;&#x636E;&#x91C7;&#x96C6;&#xFF08;&#x56FE;&#x5F62;&#x754C;&#x9762;&#xFF09;&#x3001;&#x79BB;&#x7EBF;&#x6570;&#x636E;&#x8F6C;&#x6362;&#x3002;</p>
<ul>
<li>&#x53C2;&#x6570;&#x8C03;&#x8282;&#xFF1A;&#x8FD0;&#x884C;&#x7A0B;&#x5E8F;&#x5148;&#x83B7;&#x53D6;&#x90E8;&#x5206;&#x6CE2;&#x5F62; -&gt; &#x4FDD;&#x5B58;&#x6570;&#x636E;&#x6587;&#x4EF6; -&gt; &#x79BB;&#x7EBF;&#x6587;&#x4EF6;&#x8C03;&#x8282;&#x53C2;&#x6570; -&gt; &#x4FDD;&#x5B58;&#x53C2;&#x6570;&#x6587;&#x4EF6;</li>
<li>&#x6570;&#x636E;&#x83B7;&#x53D6;&#xFF1A;&#x8FD0;&#x884C;&#x7A0B;&#x5E8F;&#xFF08;&#x8BFB;&#x53D6;&#x8C03;&#x8282;&#x597D;&#x7684;&#x53C2;&#x6570;&#xFF09; -&gt; &#x6B63;&#x5E38;&#x83B7;&#x53D6;&#x6570;&#x636E;</li>
<li>&#x6570;&#x636E;&#x8F6C;&#x6362;&#xFF1A;&#x5C06;&#x539F;&#x59CB;&#x6570;&#x636E;&#x8F6C;ROOT&#x6587;&#x4EF6;</li>
</ul>
<p>&#x5F53;&#x524D;&#x6BCF;&#x4E2A;&#x63D2;&#x4EF6;&#x6570;&#x636E;&#x5355;&#x72EC;&#x5B58;&#x5728;&#x4E00;&#x4E2A;&#x6587;&#x4EF6;&#x4E2D;&#xFF0C;&#x6CA1;&#x6709;&#x65F6;&#x65F6;&#x5728;&#x7EBF;&#x76D1;&#x89C6;&#x529F;&#x80FD;&#x3002;Trigger Rate &#x76D1;&#x89C6;&#x901A;&#x8FC7;&#x4E0D;&#x65AD; I/O &#x4ECE;&#x63D2;&#x4EF6; DSP &#x4E0A;&#x83B7;&#x53D6;&#x3002;</p>
<p>&#x4EE5;&#x4E0B;&#x4E3A;&#x53C2;&#x6570;&#x8C03;&#x8282;&#x8BE6;&#x7EC6;&#x6D41;&#x7A0B;&#xFF1A;</p>
<p><img src="img/ReadWF1.png" alt="&#x7A0B;&#x5E8F;&#x754C;&#x9762;"></p>
<p>&#x542F;&#x52A8;&#x7A0B;&#x5E8F;&#xFF0C;&#x754C;&#x9762;&#x5982;&#x4E0A;&#x56FE;&#x3002;&#x6309;&#x5DE6;&#x7AEF;&#x84DD;&#x8272;<strong>Boot</strong>&#x6309;&#x94AE;&#xFF0C;&#x7B49;&#x5F85;&#x521D;&#x59CB;&#x5316;&#x5B8C;&#x6210;&#x3002;&#x53EF;&#x6309;&#x84DD;&#x8272;<strong>Read WF</strong>&#x6309;&#x94AE;&#x4ECE;&#x63D2;&#x4EF6;&#x4E2D;&#x6293;&#x53D6;&#x65F6;&#x65F6;&#x6CE2;&#x5F62;&#x3002;</p>
<p><img src="img/ParGUI1.png" alt="&#x7A0B;&#x5E8F;&#x754C;&#x9762;"></p>
<p>&#x4E0A;&#x56FE;&#x4E3A;&#x53C2;&#x6570;&#x8C03;&#x8282;&#x754C;&#x9762;&#xFF0C;&#x6DB5;&#x76D6;&#x4E86;&#x6240;&#x6709;&#x53EF;&#x8C03;&#x8282;&#x53C2;&#x6570;&#x3002;&#x5DE6;&#x4E0A;&#x89D2;&#x83DC;&#x5355;&#x680F;&#x4E0A;<strong>UV_Setup</strong>&#x53EF;&#x5F00;&#x542F;&#x53C2;&#x6570;&#x8BBE;&#x7F6E;&#x754C;&#x9762;&#x3002;</p>
<p><img src="img/Start1.png" alt="&#x7A0B;&#x5E8F;&#x754C;&#x9762;"></p>
<p>&#x4E0A;&#x56FE;&#x4E3A;&#x63A7;&#x5236;&#x83B7;&#x53D6;&#x754C;&#x9762;&#x3002;&#x5148;&#x6309;<strong>Complete</strong>&#x6309;&#x94AE;&#x8BBE;&#x7F6E;&#x6587;&#x4EF6;&#x8DEF;&#x5F84;&#x7B49;&#x4FE1;&#x606F;&#x3002;&#x7136;&#x540E;&#x5373;&#x53EF;&#x6309;<strong>LSRunStart</strong>&#x6309;&#x94AE;&#x5F00;&#x59CB;&#x83B7;&#x53D6;&#x6570;&#x636E;&#x3002;&#x5148;&#x91C7;&#x96C6;&#x90E8;&#x5206;&#x6570;&#x636E;&#x3002;</p>
<p><img src="img/TestPar1.png" alt="&#x7A0B;&#x5E8F;&#x754C;&#x9762;"></p>
<p>&#x4E0A;&#x56FE;&#x4E3A;&#x79BB;&#x7EBF;&#x6570;&#x636E;&#x8C03;&#x8282;&#x53C2;&#x6570;&#x754C;&#x9762;&#x3002;&#x9996;&#x5148;&#x8BFB;&#x53D6;&#x79BB;&#x7EBF;&#x6587;&#x4EF6;&#x4E2D;&#x7684;&#x6CE2;&#x5F62;&#xFF08;&#x56FE;&#x4E2D;&#x9ED1;&#x7EBF;&#xFF09;&#xFF0C;&#x7136;&#x540E;&#x8C03;&#x7528;&#x63D2;&#x4EF6;&#x4E2D;&#x8BE5;&#x8DEF;&#x4FE1;&#x53F7;&#x7684;&#x53C2;&#x6570;&#x753B;&#x51FA; Trigger Filter&#xFF08;&#x84DD;&#x7EBF;&#xFF09;&#x3001;CFD&#xFF08;&#x7EA2;&#x7EBF;&#xFF09;&#x3001;Energy Filter&#xFF08;&#x7EFF;&#x7EBF;&#xFF09;&#x3001;Baseline&#xFF08;&#x9EC4;&#x7EBF;&#xFF09;&#x66F2;&#x7EBF;&#x3002;&#x53EF;&#x901A;&#x8FC7;&#x5E95;&#x7AEF;&#x7684;&#x53C2;&#x6570;&#x8C03;&#x8282;&#x7A97;&#x53E3;&#x8C03;&#x8282;&#x8BE5;&#x8DEF;&#x4FE1;&#x53F7;&#x7684;&#x53C2;&#x6570;&#x76F4;&#x5230;&#x7B26;&#x5408;&#x5B9E;&#x9A8C;&#x8981;&#x6C42;&#x3002;</p>
<p><img src="img/SavePar1.png" alt="&#x7A0B;&#x5E8F;&#x754C;&#x9762;"></p>
<p>&#x8C03;&#x8282;&#x597D;&#x4EE5;&#x4E0A;&#x53C2;&#x6570;&#x540E;&#xFF0C;&#x6309;<strong>UV_Setup</strong>&#x4E0B;&#x7684;<strong>Save2File</strong>&#x4FDD;&#x5B58;&#x53C2;&#x6570;&#x6587;&#x4EF6;&#x3002;&#x7136;&#x540E;&#x4FEE;&#x6539;<strong>cfgPixie16.txt</strong>&#x6587;&#x4EF6;&#x4E2D;&#x7684;&#x5012;&#x6570;&#x7B2C;&#x4E8C;&#x4E2A;&#x53C2;&#x6570;&#x4E3A;&#x521A;&#x4FDD;&#x5B58;&#x7684;&#x6587;&#x4EF6;&#x3002;</p>
<h1 id="&#x6B63;&#x5728;&#x8FDB;&#x884C;">&#x6B63;&#x5728;&#x8FDB;&#x884C;</h1>
<p>&#x79BB;&#x7EBF;&#x6570;&#x636E;&#x5904;&#x7406;&#xFF1A;</p>
<p>&#x63D0;&#x4F9B;&#x79BB;&#x7EBF;&#x5904;&#x7406;&#x6A21;&#x5757;&#xFF0C;&#x6A21;&#x5757;&#x5B9E;&#x73B0;&#x8BFB;&#x53D6;&#x4E4B;&#x524D;&#x4FDD;&#x5B58;&#x7684;&#x8BBE;&#x7F6E;&#x53C2;&#x6570;&#xFF0C;ROOT&#x6587;&#x4EF6;&#x53EF;&#x8C03;&#x7528;&#x7B97;&#x6CD5;&#x67E5;&#x770B;&#x6CE2;&#x5F62;&#x3001;&#x80FD;&#x91CF;&#x3001;&#x5806;&#x79EF;&#x7B49;&#x4FE1;&#x606F;&#x3002;</p>
<p>&#x63D2;&#x4EF6;&#x524D;&#x9762;&#x677F;&#x7684;&#x63A5;&#x53E3;&#x6D4B;&#x8BD5;&#xFF1A;</p>
<ul>
<li>&#x5916;&#x90E8; Trigger &#x6D4B;&#x8BD5;&#x3002;</li>
<li>&#x524D;&#x9762;&#x677F;&#x76D1;&#x89C6;&#x4FE1;&#x53F7;&#x7684;&#x8F93;&#x51FA;&#x6D4B;&#x8BD5;&#x3002;</li>
</ul>
<h1 id="&#x7B49;&#x5F85;&#x5B8C;&#x6210;">&#x7B49;&#x5F85;&#x5B8C;&#x6210;</h1>
<ul>
<li>&#x7531;&#x4E8E;&#x8001;&#x7248;&#x672C;&#x8BF4;&#x660E;&#x4E66;&#xFF08;2009&#x5E74;&#x7248;&#xFF09;&#x4E2D;&#x5173;&#x4E8E; &#x7B26;&#x5408;/&#x53CD;&#x7B26;&#x5408; &#x7684;&#x8BBE;&#x7F6E;&#x8BF4;&#x660E;&#x5DF2;&#x7ECF;&#x4E0D;&#x9002;&#x7528;&#x4E8E;&#x5F53;&#x524D;&#x7248;&#x672C; API &#x63A5;&#x53E3;&#x3002;&#x6211;&#x4EEC;&#x4E0E;&#x8C2D;&#x8F89;&#x8054;&#x7CFB;&#xFF0C;&#x4ED6;&#x4EEC;&#x5F53;&#x524D;&#x6B63;&#x5728;&#x66F4;&#x65B0;&#x8BF4;&#x660E;&#x4E66;&#xFF0C;&#x7B49;&#x8FC7;&#x51E0;&#x5468;&#x65B0;&#x7684;&#x8BF4;&#x660E;&#x4E66;&#x51FA;&#x6765;&#x518D;&#x52A0;&#x4E0A; &#x7B26;&#x5408;/&#x53CD;&#x7B26;&#x5408; &#x8BBE;&#x7F6E;&#x3002;</li>
<li>&#x5F53;&#x524D;&#x56FE;&#x5F62;&#x754C;&#x9762;&#x57FA;&#x4E8E;ROOT5&#xFF0C;&#x6539;&#x8FDB;&#x4EE5;&#x517C;&#x5BB9;ROOT6&#x3002;</li>
<li>&#x4E00;&#x4E9B;&#x53C2;&#x6570;&#x7684;&#x8BBE;&#x7F6E;&#x8981;&#x6C42;&#x3001;&#x8BBE;&#x7F6E;&#x8303;&#x56F4;&#x7B49;&#x8FD8;&#x5728;&#x8BF7;&#x6559;&#x8C2D;&#x8F89;&#xFF0C;&#x53C2;&#x6570;&#x8BBE;&#x7F6E;&#x8BE6;&#x7EC6;&#x8BF4;&#x660E;&#x4E66;&#x5C06;&#x5728;&#x4E4B;&#x540E;&#x7ED9;&#x51FA;&#x3002;</li>
<li>&#x79BB;&#x7EBF;&#x53C2;&#x6570;&#x8C03;&#x8282;&#x754C;&#x9762;&#x6DFB;&#x52A0;&#x5FEB;&#x901F;&#x67E5;&#x770B;&#x80FD;&#x91CF;&#x5206;&#x8FA8;&#x529F;&#x80FD;&#x3002;</li>
</ul>
<hr>
<p>&#x4F7F;&#x7528;&#x6CE8;&#x610F;&#x4E8B;&#x9879;&#xFF1A;</p>
<p>&#x65F6;&#x95F4;&#x540C;&#x6B65;&#x8981;&#x6C42;&#x63D2;&#x4EF6;&#x4E0A;&#x8DF3;&#x9488;&#x7684;&#x63A5;&#x6CD5;&#x7B2C;&#x4E00;&#x4E2A;&#x63D2;&#x4EF6;&#x4E0E;&#x5176;&#x4F59;&#x63D2;&#x4EF6;&#x4E0D;&#x540C;&#x3002;</p>
<!-- Version1.md ends here -->

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="FrontPanel.html" class="navigation navigation-prev navigation-unique" aria-label="Previous page: 前面版">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"版本一","level":"1.3","depth":1,"previous":{"title":"前面版","level":"1.2","depth":1,"path":"FrontPanel.md","ref":"FrontPanel.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"Version1.md","mtime":"2016-10-29T00:58:32.961Z","type":"markdown"},"gitbook":{"version":"3.2.2","time":"2016-11-19T11:57:54.955Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

